<?php
// Змінні для з'єднання з базою даних
$host = "localhost"; // Хост бази даних
$username = "root"; // Ім'я користувача бази даних
$password = ""; // Пароль користувача бази даних
$database = "programist"; // Назва бази даних

// Створення з'єднання з базою даних
$conn = new mysqli($host, $username, $password, $database);

// Перевірка наявності помилок при з'єднанні
if ($conn->connect_error) {
    die("Помилка з'єднання з базою даних: " . $conn->connect_error);
}



// Тут ви можете виконати свої запити та операції з базою даних

// Закриття з'єднання після завершення роботи
?>